n = -7
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:02x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))
n += 1
print('10진수: {0:3d} 2진수: {1:8b} 8진수: {1:4o} 16진수: {1:2x}'.format(n, n & 0xff))